models/Customer.php

    public static function findIdentity($id)
    {
        return static::findOne($id);
---
SELECT * FROM `customers` WHERE `id`=4

    public static function findByEmail($email)
    {
       return static::findOne(['email' => $email]);
---
SELECT EXISTS(SELECT * FROM `customers` WHERE (`email`='test4@test.test'))
SELECT * FROM `customers` WHERE `email`='test4@test.test'

    public function register()
    {
        if ($this->validate()) {
            return $this->save();
---
INSERT INTO `customers` (`name`, `email`, `password`, `auth_key`) VALUES ('', 'test4@test.test', '$2y$13$/XLo0JhBplTPnfOVc/3IEuBNHV5jtxZs8wt0L45EPfNv464KpeGg.', 'nYIeiK-5Mdi9fJjRH-yO')